# Question #1

In [2]:
import pandas as pd

In [73]:
# Sample data from the document
data = {
    'name': ['Andy', 'Jose', 'Dieu', 'Chloe', 'Jose'],
    'continent': ['America', 'Europe', 'Asia', 'America', 'Europe'],
    'college': ['Lib Arts', 'Business', 'Engineering', 'Engineering', 'Business']
}
df = pd.DataFrame(data)
df

    name continent      college
0   Andy   America     Lib Arts
1   Jose    Europe     Business
2   Dieu      Asia  Engineering
3  Chloe   America  Engineering
4   Jose    Europe     Business

### Question #1 - (A)

In [74]:
df.drop_duplicates(inplace=True)
df # drop the duplicate data point (Jose-Europe-Business)

    name continent      college
0   Andy   America     Lib Arts
1   Jose    Europe     Business
2   Dieu      Asia  Engineering
3  Chloe   America  Engineering

### Question #1 - (B)

In [75]:
COUNTS = df.groupby(['continent', 'college']).size().reset_index(name='count')
COUNTS

  continent      college  count
0   America  Engineering      1
1   America     Lib Arts      1
2      Asia  Engineering      1
3    Europe     Business      1

### Question #1 - (C)

In [76]:
COUNTS_pivot = COUNTS.pivot(index='college', columns='continent', values='count')
COUNTS_pivot

continent    America  Asia  Europe
college
Business         NaN   NaN     1.0
Engineering      1.0   1.0     NaN
Lib Arts         1.0   NaN     NaN

### Question #1 - (D)

In this case, no additional index levels were created.

### Question #1 - (E)

In [77]:
COUNTS_pivot.fillna(0, inplace=True)
COUNTS_pivot

continent    America  Asia  Europe
college
Business         0.0   0.0     1.0
Engineering      1.0   1.0     0.0
Lib Arts         1.0   0.0     0.0

### Question #1 - (F)

In [78]:
COUNTS_sorted = COUNTS_pivot.sort_values(by='college', ascending=False)
COUNTS_sorted

continent    America  Asia  Europe
college
Lib Arts         1.0   0.0     0.0
Engineering      1.0   1.0     0.0
Business         0.0   0.0     1.0

# Question #2

In [82]:
data = {
    'month': ['jan', 'feb', 'mar', 'apr', 'may', 'jun'],
    'eggs': [47, 110, 221, 77, 132, 205]
}
df = pd.DataFrame(data)
df.set_index('month', inplace=True)

### Question #2-(A)

In [88]:
# Answer is A = (df.loc[[‘apr’, ‘may’, ‘jun’],][‘eggs’] > 100).sum()
(df.loc[['apr', 'may', 'jun']]['eggs']>100).sum()

2

### Question #2-(B)

In [101]:
# Answer is A = strptime, .date()

import datetime
datetime.datetime.strptime("01012018", "%d%m%Y").date()

datetime.date(2018, 1, 1)

### Question #2-(C)

I think that this problem has not answer.</br>
Nevertheless, the closest example to the answer is "D".

In [111]:
from sklearn import datasets
iris = datasets.load_iris()
df_iris = pd.DataFrame(data=iris.data, columns=iris.feature_names)
df_iris['Species'] = [iris.target_names[i] for i in iris.target]
df_iris['petal width (cm)'] = df_iris['petal width (cm)'].astype(float)

In [123]:
# ddd = df_iris[(df_iris['Species']=='setosa')
#         & (df_iris['petal width (cm)']<2)]
# ddd.sort_values('sepal length (cm)', desc)
# ddd.sort_descending('sepal length (cm)')